"""
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""

season_list = ("зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима")

while True:
    mounth = input("Введите номер месяца от 1 до 12: ")
    if mounth.isdigit():
        index = int(mounth) - 1
        print(f"Вы выбрали - {season_list[index]}")
        break
    else:
        print("Ошибка! Введите число от 1 до 12: ")


season_dict = {
    1: 'зима',
    2: 'зима',
    3: 'весна',
    4: 'весна',
    5: 'весна',
    6: 'лето',
    7: 'лето',
    8: 'лето',
    9: 'осень',
    10: 'осень',
    11: 'осень',
    12: 'осень',
}

while True:
    mounth1 = input("Введите номер месяца от 1 до 12: ")
    if mounth1.isdigit():
        index1 = int(mounth1)
        print(f"Вы выбрали - {season_dict.get(index1)}")
        break
    else:
        print("Ошибка! Введите число от 1 до 12: ")
